app/views/cocktails/show.html.erb

SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 1]]
---
          </thead>
          <% @cocktail.doses.each do |dose| %>

SELECT  1 AS one FROM "reviews" WHERE "reviews"."cocktail_id" = $1 LIMIT $2  [["cocktail_id", 1], ["LIMIT", 1]]
---
      <h3>Reviews</h3>
      <% if @cocktail.reviews.empty? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."cocktail_id" = $1  [["cocktail_id", 1]]
---
        <ul class="list-group">
          <% @cocktail.reviews.each do |review| %>