app/controllers/cocktails_controller.rb

SELECT "cocktails".* FROM "cocktails"
---
  def index
    @cocktails = Cocktail.all

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @cocktail = Cocktail.find(params[:id])

INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Caipirinia"], ["created_at", "2018-11-08 16:12:51.510758"], ["updated_at", "2018-11-08 16:12:51.510758"]]
---
  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save